Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་ཁྱོད་སྙིང་མ་ཆུང་ཅིག་དང་བདག་གིས་སང་ནང་པར་ཁྱོད་ལ་ཁ་ཟས་བསྟབས་སོ་ཞེས་སྨྲས་ནས་དེ་གནས་ཁང་དུ་སོང་ངོ་། །
en: “Don’t worry, Venerable Small One with a Curving Spine! Tomorrow I shall have food for you,” and returned to his hut.

source: དེ་ནས་དེ་ཕྱི་དེ་ཉིན་པར་ལྷུང་བཟེད་གཉིས་ཐོགས་ཏེ་མཉན་དུ་ཡོད་པར་སོང་ནས་དེས་བསོད་སྙོམས་ལྷུང་བཟེད་དོ་བསླངས་ཏེ་གཅིག་ནི་བདག་ཉིད་ཀྱིས་ཟོས་སོ། །
en: The next day, carrying two alms bowls, he went for alms in Śrāvastī. After begging alms there, he ate some himself.

source: གཅིག་ནི་དེའི་དོན་དུ་ཁྱེར་ནས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་ཆས་ཏེ་སོང་བ་ལས། དེའི་སྔོན་གྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་དེ་འགྲོ་བ་ན་མི་མ་ཡིན་པ་རྣམས་ཀྱིས་ཁ་ཟས་དེ་མི་སྣང་བར་བྱས་སོ། །
en: Intending the rest for Venerable Small Person with a Curving Spine, he was carrying them to the garden of Prince Jeta when Venerable Small Person with a Curving Spine’s past actions ripened such that nonhuman spirits appeared along the way, and they made the food disappear.

source: དེ་ནས་དེས་བསམས་པ་ད་བདག་ཕྱིར་མཉན་དུ་ཡོད་པར་སོང་ན་ནི་དྲོ་ཡོལ་བར་འགྱུར་རོ་སྙམ་སྟེ།
en: Then Venerable Śāriputra thought, “By the time I make it back to Śrāvastī, it will be past noon.”

source: ཅང་མི་ཟེར་བར་འདུག་ནས། ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་དེའི་ཉིན་པར་དུ་ལན་དྲུག་སྨྱུང་བར་གྱུར་ཏོ། །
en: So he said nothing, and on that day Venerable Small One with a Curving Spine went without food a sixth time.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་བསམས་པ།
en: Again Venerable Śāriputra thought,

source: བདག་གིས་སང་ནང་པར་དེ་ལ་ཁ་ཟས་བསྟབས་པར་བྱའོ་སྙམ་ནས།
en: “Tomorrow I shall bring him food.”

source: ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་ཁྱོད་སྙིང་མ་ཆུང་ཤིག་དང་བདག་གིས་སང་ཁྱོད་ལ་ཁ་ཟས་བསྟབས་སོ་ཞེས་སྨྲས་ནས་དེ་གནས་ཁང་དུ་སོང་ངོ་། །
en: “Don’t worry, Venerable Small One with a Curving Spine! Tomorrow I shall have food for you,” and returned to his hut.

source: དེ་ནས་དེའི་ཕྱི་དེ་ཉིན་པར་ལྷུང་བཟེད་གཉིས་ཐོགས་ཏེ་མཉན་དུ་ཡོད་པར་སོང་ནས། དེས་བསོད་སྙོམས་ལྷུང་བཟེད་དོ་བསླངས་ཏེ་གཅིག་ནི་བདག་ཉིད་ཀྱིས་ཟོས་སོ། །
en: The next day, carrying two alms bowls, he set out for Śrāvastī. After begging alms there, he ate some himself.

source: གཅིག་ནི་ཁྱེར་ཏེ་ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་གི་གནས་ཁང་དུ་སོང་བ་ལས། ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་གི་སྔོན་གྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་གནས་ཁང་གི་སྒོ་ཡང་མེད་སྐར་ཁུང་ཡང་མེད་པར་གྱུར་ཏོ། །
en: Intending the rest for Venerable Small One with a Curving Spine, he was carrying them to Venerable Small Person with a Curving Spine’s hut when Venerable Small Person with a Curving Spine’s past actions ripened such that on the hut neither doors nor windows were to be found.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་རྫུ་འཕྲུལ་གྱིས་སྒོ་སྤྲུལ་ཏེ་ནང་དུ་སོང་ནས་དེ་ལ་སྨྲས་པ།
en: Then by means of a miracle Venerable Śāriputra manifested a door, went inside, and said,

source: ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་ལོངས་ལ་ཁ་གདོང་ཁྲུས་ཤིག །
en: “Venerable Small Person with a Curving Spine, rise now and wash your face.”

source: དེས་སྨྲས་པ་བདག་གིས་ཁ་གདོང་བཀྲུས་ཟིན་ནོ། །
en: “I have already washed my face,” he replied.

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ལྷུང་བཟེད་དང་ཆུ་ཚགས་ཕྱོགས་གཅིག་ཏུ་བཞག་ནས། ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་གི་ལག་ཏུ་ཆུ་བཏང་སྟེ།
en: Then Venerable Śāriputra immediately set the alms bowls and water sieve to one side and placed the container of water in Venerable Small Person with a Curving Spine’s hands.

source: དེའི་མདུན་དུ་ལྷུང་བཟེད་ཀྱི་ཞབས་རྟེན་བཞག་ནས་ལྷུང་བཟེད་བླང་ཞེས་བྱས་པ་དང་།
en: After setting out stands for the alms bowls, he took one up in his own hands and said, “Here now, take your alms bowl.”

source: ལྷུང་བཟེད་དེ་ཐུར་དུ་གསེར་གྱི་ས་གཞིའི་སྟེང་དུ་སོང་ནས།
en: At that very moment, the bowl plunged down into the earth, descending all the way to the base of the universe.

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ལག་པ་གླང་པོ་ཆེའི་སྣ་ལྟ་བུ་བརྐྱང་སྟེ་ལྷུང་བཟེད་དེ་ཕྱུང་ནས་ལག་པ་གཡོན་པའི་སྟེང་དུ་བཞག་སྟེ།
en: Venerable Śāriputra extended his arm like an elephant’s trunk, drawing up the alms bowl and placing it in his left hand.

source: ལག་པ་གཡས་པས་ལེགས་པར་བྱིན་གྱིས་བརླབས་ནས་སྨྲས་པ།
en: Then he gave it a blessing with his right hand and said,

source: ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་ད་ཟོ་ཤིག །
en: “Venerable Small Person with a Curving Spine, please eat.”

source: དེ་ནས་དེས་ལྷུང་བཟེད་དེའི་ནང་ནས་ཁམ་གཅིག་བླངས་ཏེ་ བཟའ་ཞེས་བྱས་ནདེའི་ཁམ་གཅིག་པོ་དེ་ཡང་མི་སྣང་བར་གྱུར་ཏོ། །
en: He said, “I shall,” but as he lifted a single morsel of food from the bowl, the morsel actually disappeared.

source: དེ་བཞིན་དུ་ཁམ་བླངས་སོ་ཅོག་མི་སྣང་བར་གྱུར་ཏོ། །
en: Every morsel of food that he took from the bowl disappeared in just the same way.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་བདག་ཉིད་ཀྱི་ལག་པ་གཡས་པས་ཁམ་གཅིག་བླངས་ཏེ་ཁར་གཞུག་ཅེས་བྱས་ན། དེའི་ཁ་མེད་པར་བྱིལ་པོར་གྱུར་ཏོ། །
en: Then Venerable Śāriputra took up a morsel in his own right hand and tried to put it in Venerable Small Person with a Curving Spine’s mouth and his mouth disappeared—he became like a mound of grass without an opening.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུའི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཅི་ཡོད་པ་བྱས་ཀྱང་དེའི་ཁ་གདོད་མ་ནུས་ཏེ། དེའི་སྐབས་སུ་དྲོ་ཡོལ་བར་གྱུར་ཏོ། །
en: Venerable Śāriputra’s miraculous powers could not make his mouth reappear, and it grew to be past noon.

source: དྲོ་ཡོལ་བའི་འོག་ཏུ་ནི་དེའི་ཁ་དོད་པར་གྱུར་ཏེ། སྔ་མཁོ་བཞིན་དུ་གྱུར་ཏོ། །
en: After noontime his mouth became as it was before.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་དྲིས་པ་ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་ཁྱོད་ལ་ནང་ན་ཅི་མི་བཟོད་པར་གནོད།
en: Then Venerable Śāriputra asked, “Venerable Small Person with a Curving Spine, what is tormenting you so unbearably?”

source: དེས་སྨྲས་པ། བཙུན་པ་ཤཱ་རིའི་བུ་བདག་སྐོམ་གྱིས་གདུངས་ཀྱིས་ཆུ་བྱིན་ཅིག་དང་བཏུང་ངོ་། །
en: “Lord Śāriputra,” he replied, “I am tormented by thirst. Please give me some water to drink!”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ལྷུང་བཟེད་ཆུས་བཀང་སྟེ་བྱིན་ནས། ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་གིས་བླངས་ཏེ་ཁར་གཏུགས་ནས་བཏུང་ཞེས་བྱས་ནས།
en: Venerable Śāriputra filled a alms bowl with water, and Venerable Small Person with a Curving Spine picked it up, lifted it to his mouth and said, “Something to drink!”

source: དེའི་ལས་ལས་སྐྱེས་པའི་མི་དག་བྱུང་ནས་ལྷུང་བཟེད་དེའི་ནང་དུ་ཐལ་བ་བླུགས་སོ། །
en: Then, due to his past actions, human beings appeared and began dumping ashes into the bowl.

source: དེ་ནས་དེས་མཐོང་ནས་བདག་གིས་མྱོང་བར་འགྱུར་བར་ངེས་པའི་ལས་འདི་དག་བྱས་ཤིང་བསགས་ཏེ།
en: When he saw this, he thought, “All that I am experiencing certainly comes from the actions I myself have committed and accumulated.

source: དེ་དག་ནི་གདོན་མི་ཟ་བར་འོང་བ་དང་རྐྱེན་གྲུབ་པ་དང་ལྡན་པ་དང་ཚོགས་བསགས་པ་ཡིན་པས་ལས་དེ་དག་ནི་གཞན་དག་གི་ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་རྣམས་ལ་རྣམ་པར་སྨིན་ཅིང་མྱོང་བར་མི་འགྱུར་རོ་སྙམ་ནས་
en: There is no doubting their arrival, for I have put the conditions in place and accumulated the causes. Therefore they cannot ripen or be experienced in the aggregates, elements, or sense bases of another.”

source: ཐལ་སྐྱོ་དེ་ཉིད་འཐུངས་ཏེགཞི་དེ་ཉིད་ཀྱིས་འབར་བ་དང་ལམ་མེར་འདུག་པ་དང་ཆར་འབབ་པ་དང་གློག་འགྱུ་བའི་ཆོ་འཕྲུལ་རྣམས་བསྟན་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །
en: With that he quaffed the ash-gruel, and on that basis he passed into parinirvāṇa amid a miraculous display of fire and light, rain and lightning.

source: དེ་ནས་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་ཀྱིས་དེའི་སྐུ་གདུང་ལ་མཆོད་པ་བྱས་ཏེ།
en: Afterward, his fellow practitioners of the holy life venerated his remains.

source: སྐུ་གདུང་གི་མཆོད་རྟེན་བརྩིགས་ནས་བདུག་པ་དང་ཕྱེ་མ་དང་སྤོས་དང་མེ་ཏོག་གིས་མཆོད་པ་བྱས་སོ། །
en: They built a reliquary stūpa and venerated it with flowers, burning sticks of incense, incense powders, and incense cones.

source: བཙུན་པ་ཚེ་དང་ལྡན་པ་སྒུར་ཆུང་གིས་ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་ལྟོགས་ཏེ་ཤིན་ཏུ་ཕོངས་ནས་དགུང་བདུན་གྱི་བར་དུ་སྨྱུང་བར་གྱུར་ལ་ཐལ་སྐྱོ་འཚལ་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ལགས།
en: “Lord, what action did Venerable Small Person with a Curving Spine take that ripened into his being hungry and bereft, that he went hungry for seven days, and that upon eating ash-gruel he passed into parinirvāṇa?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་འདི་ཉིད་ཀྱིས་སྔོན་ཚེ་རབས་གཞན་དག་ཏུ་ཚོགས་རྙེད་ཅིང་རྐྱེན་གྲུབ་པ་དང་ལྡན་ཏེ
en: “Monks,” the Blessed One explained, “in his previous lives he himself collected the causes and put the conditions in place.

source: དབའ་རྒལ་བཞིན་དུ་འབྱུང་ལ་གདོན་མི་ཟ་བར་འོང་བའི་ལས་དེ་དག་བྱས་ཤིང་བསགས་པས་ན་
en: The actions he committed and accumulated are now returning as certainly as the tides.

source: དེ་ཉིད་ཀྱིས་ལས་བྱས་ཤིང་བསགས་པ་དེ་དག་གཞན་སུ་ཞིག་གིས་ཉམས་སུ་མྱོང་བར་འགྱུར་ཏེ
en: Since it was he himself who committed and accumulated them, who else is there to experience them?

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་རི་ཁྲོད་ཀྱི་གྲོང་ཞིག་ན་ཁྱིམ་བདག་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ་ཡོངས་སུ་འཛིན་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་ལྡན་པ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ་ཞིག་གནས་པ་
en: “Monks, in times gone by, in a certain mountain village there lived a householder, prosperous and wealthy, a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s.

source: དེས་ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནསདེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས་ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས།
en: When the time came for him to marry he took a wife, and they enjoyed themselves and coupled. As they enjoyed themselves and coupled, one day his wife conceived.

source: དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་ཁྱེའུ་ཞིག་བཙས་ཏེ།
en: After nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས་རིགས་དང་འཐུན་པར་མིང་བཏགས་ཏེ།
en: At the elaborate feast celebrating his birth they named him according to their clan.

source: འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་སོ། །
en: “They reared him on milk, yogurt, butter, ghee, and milk solids,

source: དེ་ནས་དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་ཡི་གེ་དང་ཁོང་རྩིས་དང་ཤོད་དགོད་དང་ལག་རྩིས་དང་དབྱུང་བ་དང་སྦ་བ་དང་དགྲམ་པ་དང་གོས་བརྟག་པ་དང་ནོར་བུ་བརྟག་པ་དང་རིན་པོ་ཆེ་བརྟག་པ་དང་སྤོས་བརྟག་པ་དང་སྨན་བརྟག་པ་དང་གླང་པོ་ཆེ་བརྟག་པ་དང་རྟ་བརྟག་པ་དང་གོ་མཚོན་བརྟག་པ་བསླབས་ཏེ།
en: and as he grew up he studied letters, tallying, and arithmetic; the study of seals, lending, deposits, and commerce; and the examination of cloth, jewels, gems, incense, medicine, elephants, horses, and arms and armor.

source: ཁྱིམ་བདག་དེ་ནི་སྦྱིན་པ་ལ་དགའ་བ་ཞིག་སྟེ།
en: “That householder delighted in giving.

source: ཁྱིམ་དེ་ན་དགེ་སྦྱོང་དང་བྲམ་ཟེ་དང་སྤྱོད་པ་པ་དང་ཀུན་དུ་རྒྱུ་དང་སྡུག་ཅིང་ཕོངས་པ་དང་བཀྲེན་པ་རྣམས་ལ་སྦྱིན་པ་དག་སྦྱིན་ཞིང་བསོད་ནམས་དག་བྱེད་དོ། །
en: He made merit and gave gifts at his home to ascetics, brahmins, practitioners, mendicants, the poor, and the bereft.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཁྱིམ་བདག་དེ་ཤི་ནས་
en: Then one day the householder died.

source: དེ་ཤི་བའི་འོག་ཏུ་ཡང་བུད་མེད་དེ་ཁྱིམ་ཐབ་ལ་གདུང་བས་སྔ་མའི་ལུགས་བཞིན་དུ་སྦྱིན་པ་བྱེད་པའི་རྒྱུན་མ་བཅད་དོ། །
en: After his death, as his wife grieved her spouse, she continued to give gifts as had been their custom.

source: དེ་ནས་བུ་དེས་སྨྲས་པ།
en: Thereupon her son said to her,

source: ཡུམ་ཁྱིམ་འདི་མ་གཞིག་ཅིག །
en: ‘Mother, don’t pare our house down to nothing!

source: ཁྱིམ་འདི་ཇི་ལྟར་བདག་གི་ཕས་བཙུགས་པ་བཞིན་དུ་བདག་གིས་གཟུགས་མི་ནུས་སོ་ཞེས་བྱས་ཏེ་དེ་ལྟར་དེ་ལན་མང་དུ་བཀག་ཀྱང་མ་ཕན་ཏོ། །
en: I won’t be able to run the household as father did.’ “Many times he tried to stop her like this, but it was no use.

source: དེ་ནས་ཁྱེའུས་བསམས་པ།
en: Finally the young man thought,

source: འདི་ནི་བདག་གིས་ཇི་ལྟར་བྱས་ཀྱང་མི་ཕན་གྱིས་བདག་གིས་འདི་གསད་དོ་སྙམ་ནས།
en: ‘Whatever I do, it’s no use. I shall kill her!’

source: དེ་ནས་མ་དེ་ཁང་ཕུགས་སུ་བཅུག་སྟེ་སྒོ་བཅད་ནས་ཟན་དང་སྐོམ་བཅད་དོ། །
en: So he locked up his mother in the confines of the house and deprived her of food and drink.

source: དེ་ནས་དེས་སྨྲས་པ།
en: “She pleaded with him,

source: བུ་བདག་ཐོང་ཤིག་དང་ཕྱིན་ཅད་སུ་ལ་ཡང་སྦྱིན་པར་མི་བྱེད་ལ་ཕྱིན་ཅད་ཁྱིམ་འདིར་ཡང་མི་འདུག་གོ། །
en: ‘My child, please let me go! I won’t share with anyone ever again! I can’t stay in this house forever!’

source: ཁྱེའུས་སྨྲས་པ། བདག་གིས་ཁྱོད་གསོན་བཞིན་དུ་གཏོང་མི་ནུས་སོ་ཞེས་སྨྲས་ནས།
en: “ ‘While you yet live, I cannot release you,’ the young man replied.

source: དེས་མ་དེ་ཁང་ཕུགས་དེ་ཉིད་དུ་ཞག་བདུན་གྱི་བར་དུ་ཟན་བཅད་དེ་བསྲུངས་སོ། །
en: So he locked up his mother in the confines of the house, depriving her of food, and kept her barricaded there for seven days

source: དེ་ནས་དེའི་ཁྱིམ་མིས་ཉེ་དུ་གཞན་དག་ལ་བསྙད་ནས་ཉེ་དུ་རྣམས་ལྷགས་ཏེ་དེ་བཏང་ངོ་། །
en: until the people of his house told their relatives, and the relatives came and let her go.

source: དེ་ཁང་ཕུགས་དེ་ནས་སྲོག་རྒྱུ་ཙམ་སྟེ་བྱུང་ནས་དེས་བུ་ལ་ཆུ་བསླངས་ན་ཁྱེའུ་དེས་དེ་ལ་ཐལ་སྐྱོ་བྱིན་ཏེ། ཐབས་འདིས་ན་འདི་འཆི་བར་འགྱུར་གྲང་སྙམ་མོ། །
en: “After nearly losing her life in the confines of the house, she begged her son for water. The young man thought, ‘This is sure to kill her,’ and handed her ash-gruel.

source: དེ་ནས་དེ་ལུས་ཉམ་ཆུང་བས་ཐལ་སྐྱོ་དེ་འཐུངས་པ་དང་གཞི་དེ་ཉིད་ཀྱིས་ཤིའོ། །
en: Her body was very weak, so when she drank the ash-gruel it caused her death.

source: དེའི་ཚེ་ཁྱེའུར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་སྒུར་ཆུང་འདི་ཉིད་ཡིན་ཏེ།
en: The one who was that young man then is none other than Small Person with a Curving Spine now.

source: དེས་མ་ལྟོགས་སུ་བོར་ནས་ཐལ་སྐྱོས་བསད་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས། ལོ་སྟོང་ཕྲག་དུ་མའི་བར་དུ་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་བཙོས་སོ། །
en: The acts of leaving his mother to go hungry and killing her with ash-gruel ripened into his being cooked by hell beings for hundreds upon hundreds of eons,

source: དེ་དེ་ནས་ཐར་ནས་ཀྱང་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ལྟོགས་ནས་ཐལ་སྐྱོ་འཐུངས་ཏེ་ཤིའོ། །
en: and ripened such that after he was released from that fate, wherever he was born, he went hungry until he drank ash-gruel and died.

source: ད་ལྟ་སྲིད་པ་ཐ་མ་དང་ལུས་ཐ་མ་དང་གནས་ཐ་མར་གྱུར་ཏེ།
en: “Now that he had come into what would be his final birth, his final body, his final dwelling place,

source: དགྲ་བཅོམ་པ་ཉིད་ཐོབ་པའི་བར་དུ་ཡང་ལྟོགས་ནས་ཐལ་སྐྱོ་འཐུངས་ཏེ་དེ་ཁོ་ནའི་རྐྱེན་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །
en: he continued to go hungry until he achieved arhatship. In the end, the same condition, eating ash-gruel, caused him to pass into parinirvāṇa.

source: འདི་ཉིད་ཀྱིས་ལས་གཞན་ཡང་བྱས་པ་ཡོད་དེ། ལས་དེའི་རྣམ་པར་སྨིན་པས་ལྟོགས་ནས་སྡུག་བསྔལ་ཆེན་པོ་རྙེད་དེ།
en: “He committed another act as well, an act that ripened into starvation and great suffering for him.

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: Monks, in times past, in this fortunate eon, when people lived as long as twenty thousand years and the tathāgata, the arhat, the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world,

source: དེའི་ཚེ་བཱ་རཱ་ཎ་སཱི་ན་ཁྱིམ་བདག་ཅིག་གནས་པ་ལས་ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས།
en: there lived a certain householder in Vārāṇasī. “One day his wife conceived,

source: དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་བུ་གཉིས་མཚེ་མར་བྱུང་སྟེ།
en: and after nine or ten months had passed, she gave birth to twins.

source: དེ་གཉིས་ཀྱི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས་རིགས་དང་འཐུན་པར་མིང་བཏགས་ཏེ།
en: At the elaborate feast celebrating their birth they named them according to their clan.

source: འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ནས་གང་གི་ཚེ་དེ་གཉིས་ཆེར་སྐྱེས་པ་དེའི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་དད་པ་རྙེད་ནས་དེ་གཉིས་ཀྱི་ཕ་མ་ལ་གསོལ་ཏེརབ་ཏུ་བྱུང་ནས་
en: They reared them on milk, yogurt, butter, ghee, and milk solids, and when they grew up, they found faith in the doctrine of the totally and completely awakened Buddha Kāśyapa, asked for their parents’ permission, and went forth.

source: དེ་གཉིས་ཀྱིས་སྡེ་སྣོད་གསུམ་བསླབས་ཏེ་རིག་པ་དང་གྲོལ་བའི་སྤོབས་པ་དང་ལྡན་པའི་ཆོས་སྨྲ་བར་གྱུར་ཏེ།
en: Having gone forth, they studied the Tripiṭaka and became proponents of the Dharma with all the eloquence of their wisdom and freedom.

source: དེ་གཉིས་གང་དང་གང་དུ་གནས་པ་དེ་དང་དེར་ལྷན་ཅིག་ན་གནས་སོ། །
en: They were inseparable, sticking together wherever they went.

source: དེ་གཉིས་ལས་གཅིག་ནི་གོས་དང་ཟས་དང་མལ་ཆ་དང་སྟན་དང་ནད་གསོས་དང་སྨན་ཟོང་རྣམས་རྙེད་པ་དང་ལྡན་པར་གྱུར་ཏེ། དེས་བསམས་པ་མ་ལ་བདག་ནི་ཚེགས་ཆུང་ངུས་ཡོ་བྱད་ཐམས་ཅད་འབྱོར་ལ་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་ནི་ཡོ་བྱད་མེད་པས་ཕོངས་ཀྱིས།
en: “One of the two, having acquired provisions of clothing, food, bedding, a seat, and medicines for the sick, thought, ‘How wonderful! With all the profit and acclaim I’ve gained, I can see to the welfare of my fellow practitioners of the conduct leading to liberation.

source: བདག་གིས་ཆོས་བཞིན་དུ་དགེ་འདུན་གྱི་ཞལ་ཏ་བྱ་གོར་མ་ཆག་སྙམ་ནས་
en: Let me render service to the twofold saṅgha in accord with the Dharma.’

source: ཆོས་བཞིན་དུ་དགེ་འདུན་གྱི་ཞལ་ཏ་བྱེད་པ་ལ་ཞུགས་ཏེགོས་དང་ཟས་དང་མལ་ཆ་དང་སྟན་དང་ནད་གསོས་དང་སྨན་ཟོང་རྣམས་དང་ཡོ་བྱད་ཐམས་ཅད་སྦྱོར་བར་བྱེད་དོ། །
en: He began to render service to the saṅgha in accord with the Dharma, providing provisions such as clothing, food, bedding, seats, and medicines for the sick for all their needs.

source: དེ་ནས་དེའི་ཕུ་ནུ་ཟླ་བོ་དེས་བསམས་པ།
en: “His brother thought,

source: བདག་གི་ཕུ་ནུ་འདི་ནི་བདག་གི་གྲོགས་ཡིན་ཏེ་འདི་ནི་བདག་དང་དགེ་བའི་ཕྱོགས་ཀྱིས་འབྲེལ་པ་ཡིན་ན། འདི་ནི་དགེ་འདུན་གྱི་ཞལ་ཏའི་ལས་བྱེད་འདོད་པས་འདི་ནི་བདག་གི་དགེ་བའི་ཕྱོགས་ཀྱི་བར་ཆད་བྱེད་དོ་
en: ‘This is my sibling, my friend. If indeed our virtuous works depend on one another, then his desire to render service to the saṅgha will create obstacles for my own virtuous work.’

source: སྙམ་ནས་དེ་ལ་སྨྲས་པ།
en: “Thinking this, he said to him,

source: ཕུ་ནུ་ཁྱོད་དགེ་བའི་ཕྱོགས་སྤངས་ཏེདགེ་འདུན་གྱི་ཞལ་ཏའི་ལས་འདོད་པར་མ་བྱེད་ཅིག །
en: ‘Brother, I don’t want to throw away my own virtuous work to provide for the saṅgha.’

source: དེ་ནས་དེས་ཕུ་ནུ་ཟླ་བོ་དེ་ལ་སྨྲས་པ།
en: “His brother replied,

source: བདག་ནི་ཚེགས་ཆུང་ངུས་ཡོ་བྱད་ཐམས་ཅད་འབྱོར་པ་དང་ལྡན་ལ་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་ནི་ཡོ་བྱད་མེད་པས་ཕོངས་ནས།
en: ‘Everything I’ve needed has come to me with almost no trouble at all. Yet my fellow practitioners of pure conduct are sorely lacking things they need.

source: ངས་འདི་དག་གི་དོན་བྱ་བར་ཅི་སྟེ་མི་འདོད་ཅེས་ཟེར་ནས་དེ་དེས་ལན་དུ་མ་བཀག་ཀྱང་མ་ཕན་ནས།
en: How could I not wish to help them?’ Thus, although he tried to stop his brother from helping many times, it was no use.

source: དེའི་བློ་སྐྱེས་པ་འདི་ནི་ཇི་སྲིད་དུ་འདུག་པའི་བར་དུ་བདག་གིས་མི་ཟློགས་ཀྱིས།
en: “Finally he thought, ‘So long as he yet lives, there will be no stopping this.

source: མ་ལ་བདག་གིས་ཐབས་དང་སྦྱར་ལ་ཡུལ་གཞན་དུ་ཁྲིད་དེ་
en: Oh, but let me devise some means to take him to another country!

source: དགག་པར་བྱའོ་སྙམ་དུ་བསམས་ནས
en: That will stop him.’

source: ཕུ་ནུ་ཟླ་བོ་དེས་ཐབས་དང་སྦྱར་ཏེ་ཡུལ་གཞན་དུ་ཁྲིད་ནས་དེ་ཉིད་ན་འཁོད་དོ། །
en: With this in mind, he devised a way to lead his brother to another country, and there they stayed.

source: དེ་ནས་དེ་དེ་ན་འདུག་པས་དགེ་སློང་རྣམས་ཀྱི་རྙེད་པའི་བར་ཆད་དུ་གྱུར་ཏོ། །
en: “Over time their absence became an obstacle to the livelihood of the other monks,

source: དེས་ཀྱང་དེ་ན་འདུག་བཞིན་དུ་དགེ་སློང་རྣམས་ཇི་ལྟར་ཡོ་བྱད་ཀྱིས་ཕོངས་པར་གྱུར་པ་ཐོས་ནས་ཐོས་མ་ཐག་ཏུ་ཕུ་ནུ་ཟླ་བོ་ལ་བཟླུགས་ཏེ་
en: and while they were away, his brother heard the monks were in dire straits and right away said to his sibling,

source: བདག་དེར་སོང་ལ་དགེ་སློང་རྣམས་ཡོ་བྱད་ཀྱིས་མི་ཕོངས་པར་བྱའོ་ཞེས་བྱས་སོ། །
en: ‘I shall go there and bring the monks the things they need!’

source: དེ་ནས་དེའི་ཕུ་ནུ་ཟླ་བོས་སྨྲས་པ།
en: “To this his brother replied,

source: ཕུ་ནུ་དགེ་སློང་དེ་དག་ནི་རྟག་པར་ཡི་དགས་བཞིན་དུ་གཞན་འབའ་ཞིག་ལ་རེ་ཞིང་འཁོད་ན་ཁྱོད་དགེ་བའི་ཕྱོགས་སྤངས་ཏེ། ཡང་དེར་འགྲོའམ་ཕུ་ནུ་ཟླ་བོས་སྨྲས་པ།
en: ‘Brother, those monks are just like anguished spirits, dependent on others for absolutely everything. Will you throw away your own virtuous work, then, to travel there?’

source: ཁྱོད་ཀྱིས་ངག་རྩུབ་པོ་སྨྲས་ཀྱིས་ཉེས་པ་ལ་ཉེས་སོ་ཞེས་བཤགས་པར་གྱིས་ཤིག །
en: “ ‘You must confess the mistake you’ve made by speaking harshly to me.

source: ལས་འདིའི་འབྲས་བུ་མི་སྡུག་པ་རྙེད་པར་གྱུར་ཏ་རེ་ཞེས་བྱས་ནས་
en: Otherwise you’re sure to meet with the frightful results of what you’ve done.’

source: དེ་ཡང་འགྱོད་པ་ཆེན་པོ་སྐྱེས་ཏེདེས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་པ་
en: “He was flooded with regret, and after practicing the holy life all his life, at the time of his death, he prayed,

source: དེ་ལྟར་
en: ‘May I not meet with the results of the act of speaking harshly to fellow practitioners of the holy life, and of creating obstacles to their livelihood.

source: བདག་གིས་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་ལ་ཚིག་རྩུབ་པོ་ཡང་སྨྲས། རྙེད་པའི་བར་ཆད་ཀྱང་བྱས་པའི་ལས་དེའི་འབྲས་བུ་བདག་གིས་མྱོང་བར་མ་གྱུར་ཅིག །
en: While I may not have attained any great virtues, still I have been of service to the Buddha, Dharma, and Saṅgha, and practiced pure conduct all my life.

source: འདི་ལྟར་བདག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ཀྱང་ཡོན་ཏན་ཅི་ཡང་མ་ཐོབ་ཀྱིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བདག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: Therefore, may I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.

source: དེའི་ཚེ་དགེ་སློང་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་སྒུར་ཆུང་འདི་ཉིད་ཡིན་ཏེ།
en: The one who was that monk then is none other than Small Person with a Curving Spine.

source: དེས་དེར་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་ལ་ཚིག་རྩུབ་པོ་སྨྲས་པ་དང་རྙེད་པའི་བར་ཆད་བྱས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཚེ་རབས་ལྔ་བརྒྱར་ཡི་དགས་སུ་སྐྱེས་སོ། །
en: The act of speaking harshly to fellow practitioners of the holy life ripened such that for five hundred lifetimes he took rebirth as an anguished spirit.

source: དེ་ནས་ཤི་འཕོས་ནས་ཀྱང་ལས་དེ་ཁོ་ནའི་རྣམ་པར་སྨིན་པས་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ལྟོགས་ཏེ་ཤིའོ། །
en: Once he had died and moved on from that state, that same act also ripened such that, wherever he was born, he went hungry and died.

source: ད་ལྟར་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་པའི་བར་དུ་ཡང་ལས་དེ་ཁོ་ནའི་རྣམ་པར་སྨིན་པས་ལྟོགས་ཏེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །
en: Now, having come into what would be his final birth before achieving arhatship, the act of having gone hungry ripened into his passing into parinirvāṇa.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བདག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག།།
en: ‘May I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.

source: དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ཅིག་ཅེས་བྱས་པ་དེས་ནི།
en: Going forth in his doctrine alone, may I cast away all afflictive emotions, and manifest arhatship.’

source: དགེ་སློང་དག་ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་དང་ཤིན་ཏུ་མཉམ་པ་དང་། ཤུགས་མཉམ་པ་དང་། མཛད་པ་མཉམ་པ་དང་། ཐབས་མཉམ་པ་བརྙེས་ནས་
en: “So it is, monks, now that I myself have become the very equal of the totally and completely awakened Buddha Kāśyapa—equal in strength, equal in deeds, and equal in skillful means—

source: འདིས་ང་མཉེས་པར་བྱས་ཏེམི་མཉེས་པར་མ་བྱས་ལ་ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ།། །།
en: that he has pleased me, not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.”

source: སྲིན་ཞེས་བྱ་བ་ནི།
en: The Rākṣasa

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན་ཕྱི་སའི་འདམ་ཞིག་ཏུ་སྲིན་མགོ་བོ་དགེ་སློང་གི་མགོ་བོ་འདྲ་བ་ཞིག་བྱུང་སྟེ།
en: When the Blessed One was in Śrāvastī, there lived in the sewage bogs outside Śrāvastī a certain rākṣasa.
